# ------------------------ 3.1 -------------------------------

# i = 1
# sumpar = 0
# sumimp = 0
# cuepar = 0
# propar = 0

# while i <= 270:
#     num = int(input("Ingresa un número: "))
#     if num != 0:
#         if (-1**num) > 0:
#             sumpar = sumpar + num
#             cuepar = cuepar + 1
#         else:
#             sumimp += sumimp + num
#     i += 1

# propar = sumpar/cuepar
# print(propar,sumimp)

# ------------------------------------------------------------
# /////////////////////////////////////////////////////////////
# /////////////////////////////////////////////////////////////
# ------------------------  3.2    ---------------------------
 
# band = 't'
# sumser = 0
# i = 2

# while i <= 1800:
#     sumser = sumser + 1
#     print(i)
#     if band == 't':
#         band = 'f'
#         i += 3
#     else:
#         band = 't'
#         i += 2

# print(sumser)
# ------------------------------------------------------------
# /////////////////////////////////////////////////////////////
# /////////////////////////////////////////////////////////////
# ------------------------  3.3    ---------------------------

# serie = 0
# n = int(input("Ingrese un número entero: "))
# band = 't'
# i = 1

# while i < n:
#     band = 't'
#     if band == 't':
#         serie = (serie + 1) / i
#         band = 'f'
#     else:
#         serie = (serie - 1) / i
#         band = 't'
#     i += 1

# print(serie)

# ------------------------------------------------------------
# /////////////////////////////////////////////////////////////
# /////////////////////////////////////////////////////////////
# ------------------------  3.4    ---------------------------

# nom = 0
# sue = float(input("Ingresa tu sueldo: "))

# while sue != -1:
#     if sue < 1000:
#         nsue = sue*1.15
#     else:
#         nsue = sue*1.12
#     nom += nsue
#     print(nsue)  
#     sue = float(input("Ingresa tu sueldo: "))

# print(nom)